export default {
  mandrill: {
    id: "mandrill",
    label: "鼻の両側の溝",
    background:
      "M180 310Q110 190 190 90Q300 20 410 90Q490 190 420 310M290 100L280 250Q300 280 320 250L310 100",
    answerPath:
      "M205 130L190 230M230 120L220 245M370 120L380 245M395 130L410 230",
    regions: [
      {
        x: 0.2833333333333333,
        y: 0.2625,
        width: 0.13333333333333333,
        height: 0.4,
      },
      {
        x: 0.5833333333333334,
        y: 0.2625,
        width: 0.13333333333333333,
        height: 0.4,
      },
    ],
  },
  gibbon: {
    id: "gibbon",
    label: "枝に伸ばす長い腕",
    background:
      "M50 65L550 65M250 200Q300 170 350 200L345 320L255 320ZM270 155a35 35 0 1 0 60 0a35 35 0 1 0 -60 0",
    answerPath: "M255 220Q170 180 120 75M345 220Q420 170 475 75",
    regions: [
      {
        x: 0.14166666666666666,
        y: 0.1625,
        width: 0.30833333333333335,
        height: 0.45,
      },
      {
        x: 0.55,
        y: 0.1625,
        width: 0.3,
        height: 0.45,
      },
    ],
  },
  lemur: {
    id: "lemur",
    label: "目のまわりの模様",
    background:
      "M160 130L130 55L235 100Q300 70 365 100L470 55L440 130Q460 300 300 340Q140 300 160 130M280 290L320 290L300 310Z",
    answerPath:
      "M200 165Q245 120 270 190Q240 235 200 210ZM330 190Q355 120 400 165L400 210Q360 235 330 190Z",
    regions: [
      {
        x: 0.30833333333333335,
        y: 0.3125,
        width: 0.16666666666666666,
        height: 0.2875,
      },
      {
        x: 0.525,
        y: 0.3125,
        width: 0.16666666666666666,
        height: 0.2875,
      },
    ],
    maskHoles: [
      {
        x: 0.365,
        y: 0.3975,
        width: 0.05333333333333334,
        height: 0.105,
      },
      {
        x: 0.5816666666666667,
        y: 0.3975,
        width: 0.05333333333333334,
        height: 0.105,
      },
    ],
  },
  goat: {
    id: "goat",
    label: "ヤギの瞳孔",
    answerPath: "M205 205Q305 190 405 205L405 235Q305 250 205 235Z",
    regions: [
      {
        x: 0.31666666666666665,
        y: 0.4125,
        width: 0.38333333333333336,
        height: 0.275,
      },
    ],
  },
  elephant: {
    id: "elephant",
    label: "頭の輪郭",
    background:
      "M180 300Q90 280 90 170Q100 70 220 80Q300 30 380 90Q520 80 510 200Q500 300 410 300M220 175L230 175M370 175L380 175",
    answerPath:
      "M180 155Q190 70 240 75Q275 80 300 125Q325 80 365 75Q410 80 420 155",
    regions: [
      {
        x: 0.2833333333333333,
        y: 0.1125,
        width: 0.43333333333333335,
        height: 0.325,
      },
    ],
  },
  capuchin: {
    id: "capuchin",
    label: "巻きつく尾",
    background:
      "M200 160Q120 120 120 220Q160 310 270 260L330 160M200 150a45 45 0 1 0 70 -40a45 45 0 1 0 -70 40M380 70L380 330",
    answerPath:
      "M260 260Q440 360 465 200Q470 110 400 130Q350 150 385 190Q420 210 425 175",
    regions: [
      {
        x: 0.425,
        y: 0.275,
        width: 0.4,
        height: 0.65,
      },
    ],
  },
  macaque: {
    id: "macaque",
    label: "お尻の毛の境目",
    background:
      "M170 100Q300 40 430 100L460 290M140 290L170 100M220 300L200 365M380 300L400 365",
    answerPath:
      "M285 190Q200 130 190 220Q190 285 285 260ZM315 190Q400 130 410 220Q410 285 315 260Z",
    regions: [
      {
        x: 0.2916666666666667,
        y: 0.35,
        width: 0.2,
        height: 0.375,
      },
      {
        x: 0.5083333333333333,
        y: 0.35,
        width: 0.2,
        height: 0.375,
      },
    ],
  },
  badger: {
    id: "badger",
    label: "顔の縦の模様",
    background:
      "M170 150Q100 70 195 85Q300 30 405 85Q500 70 430 150L365 310L300 345L235 310ZM280 310L320 310",
    answerPath: "M190 115Q215 180 275 295M410 115Q385 180 325 295",
    regions: [
      {
        x: 0.2833333333333333,
        y: 0.25,
        width: 0.2,
        height: 0.525,
      },
      {
        x: 0.5166666666666667,
        y: 0.25,
        width: 0.2,
        height: 0.525,
      },
    ],
    maskHoles: [
      {
        x: 0.365,
        y: 0.3975,
        width: 0.05333333333333334,
        height: 0.105,
      },
      {
        x: 0.5816666666666667,
        y: 0.3975,
        width: 0.05333333333333334,
        height: 0.105,
      },
    ],
  },
  zebra: {
    id: "zebra",
    label: "ひづめの外側",
    background: "M250 40L245 210M350 40L355 210M120 340L480 340",
    answerPath: "M245 210Q205 250 195 325L405 325Q395 250 355 210Z",
    regions: [
      {
        x: 0.3,
        y: 0.4875,
        width: 0.4,
        height: 0.3625,
      },
    ],
  },
  giraffe: {
    id: "giraffe",
    label: "食べるときの舌",
    background:
      "M160 70L200 120L370 120L450 200Q410 245 290 245L230 340M220 170L230 170M470 70L500 250",
    answerPath:
      "M405 220Q500 255 475 310Q440 345 410 300L430 285Q455 320 455 290Q450 265 390 250",
    regions: [
      {
        x: 0.6333333333333333,
        y: 0.5375,
        width: 0.2,
        height: 0.35,
      },
    ],
  },
  hippo: {
    id: "hippo",
    label: "水面に出る鼻の穴",
    background:
      "M130 240Q90 120 190 100L410 100Q510 120 470 240M60 260Q170 235 300 260T540 260M185 115L185 125M415 115L415 125",
    answerPath:
      "M225 180a18 12 0 1 0 36 0a18 12 0 1 0 -36 0M339 180a18 12 0 1 0 36 0a18 12 0 1 0 -36 0",
    regions: [
      {
        x: 0.35,
        y: 0.3875,
        width: 0.10833333333333334,
        height: 0.1375,
      },
      {
        x: 0.5416666666666666,
        y: 0.3875,
        width: 0.10833333333333334,
        height: 0.1375,
      },
    ],
  },
  fennec: {
    id: "fennec",
    label: "足先の輪郭",
    background: "M245 50L240 180M355 50L360 180M130 340L470 340",
    answerPath:
      "M240 180Q185 230 200 310Q250 340 300 315Q350 340 400 310Q415 230 360 180M260 270L260 315M340 270L340 315",
    regions: [
      {
        x: 0.30833333333333335,
        y: 0.4375,
        width: 0.38333333333333336,
        height: 0.4125,
      },
    ],
  },
  gorilla: {
    id: "gorilla",
    label: "頭の上の輪郭",
    background:
      "M170 180L150 280Q300 370 450 280L430 180M220 230Q300 200 380 230M250 290L350 290",
    answerPath: "M170 180Q175 110 235 90L295 55L330 100Q415 110 430 180",
    regions: [
      {
        x: 0.25833333333333336,
        y: 0.0875,
        width: 0.48333333333333334,
        height: 0.3125,
      },
    ],
  },
  donkey: {
    id: "donkey",
    label: "背中の線",
    background:
      "M100 160Q300 90 500 160L490 290Q300 340 110 290ZM160 160L140 80M180 150L180 70",
    answerPath: "M145 225L465 225M225 135L225 310",
    regions: [
      {
        x: 0.225,
        y: 0.5125,
        width: 0.5666666666666667,
        height: 0.1,
      },
      {
        x: 0.3416666666666667,
        y: 0.3125,
        width: 0.06666666666666667,
        height: 0.5,
      },
    ],
  },
  meerkat: {
    id: "meerkat",
    label: "目のまわりの暗い模様",
    background:
      "M180 150Q140 65 215 105Q300 50 385 105Q460 65 420 150L370 300L300 330L230 300ZM280 295L320 295",
    answerPath:
      "M195 180Q230 145 270 180Q245 215 195 200ZM330 180Q370 145 405 180L405 200Q355 215 330 180Z",
    regions: [
      {
        x: 0.3,
        y: 0.35,
        width: 0.18333333333333332,
        height: 0.2125,
      },
      {
        x: 0.5166666666666667,
        y: 0.35,
        width: 0.18333333333333332,
        height: 0.2125,
      },
    ],
    maskHoles: [
      {
        x: 0.365,
        y: 0.3975,
        width: 0.05333333333333334,
        height: 0.105,
      },
      {
        x: 0.5816666666666667,
        y: 0.3975,
        width: 0.05333333333333334,
        height: 0.105,
      },
    ],
  },
  deer: {
    id: "deer",
    label: "背中の白い模様",
    background: "M90 180Q300 90 510 180L490 290Q300 330 110 290Z",
    answerPath:
      "M180 190l12 0M250 175l12 0M330 175l12 0M410 195l12 0M210 255l12 0M295 240l12 0M380 255l12 0",
    regions: [
      {
        x: 0.26666666666666666,
        y: 0.3875,
        width: 0.475,
        height: 0.3125,
      },
    ],
  },
  sheep: {
    id: "sheep",
    label: "ヒツジの瞳孔",
    regions: [
      {
        x: 0.31666666666666665,
        y: 0.4125,
        width: 0.38333333333333336,
        height: 0.275,
      },
    ],
    answerPath: "M205 205Q305 190 405 205L405 235Q305 250 205 235Z",
  },
  "giraffe-hoof": {
    id: "giraffe-hoof",
    label: "二つに分かれたひづめ",
    regions: [
      {
        x: 0.3,
        y: 0.4875,
        width: 0.4,
        height: 0.3625,
      },
    ],
    answerPath:
      "M245 210Q205 250 200 325L290 325L300 255L310 325L400 325Q395 250 355 210",
  },
  "hippo-body": {
    id: "hippo-body",
    label: "丸い背中の輪郭",
    regions: [
      {
        x: 0.2916666666666667,
        y: 0.1875,
        width: 0.5583333333333333,
        height: 0.3,
      },
    ],
    answerPath: "M185 180Q225 75 340 95Q465 85 500 180",
  },
  "fennec-tail": {
    id: "fennec-tail",
    label: "ふさふさした尾",
    regions: [
      {
        x: 0.5333333333333333,
        y: 0.5,
        width: 0.38333333333333336,
        height: 0.375,
      },
    ],
    answerPath: "M330 225Q405 315 470 310L520 270Q455 285 395 235",
  },
};
